JoeBakalor/NRF52DynamicGpioController/nrf_gpio_service.c
    // BLUEBIRD: add read/write properties to our characteristic
    ble_gatts_char_md_t char_md;
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.read = 1;
    char_md.char_props.write = 1;

    
    // BLUEBIRD: configuring Client Characteristic Configuration Descriptor metadata and add to char_md structure
    ble_gatts_attr_md_t cccd_md;
    memset(&cccd_md, 0, sizeof(cccd_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.vloc                = BLE_GATTS_VLOC_STACK;    
    char_md.p_cccd_md           = &cccd_md;
    char_md.char_props.notify   = 1;
   
    
    // BLUEBIRD: configure the attribute metadata
    ble_gatts_attr_md_t attr_md;
    memset(&attr_md, 0, sizeof(attr_md)); 
    attr_md.vloc        = BLE_GATTS_VLOC_STACK;   
    
    
    // SENXIS: set read/write security levels to our characteristic
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    
    
    // BLUEBIRD: configure the characteristic value attribute
    ble_gatts_attr_t    attr_char_value;
    memset(&attr_char_value, 0, sizeof(attr_char_value));        
    attr_char_value.p_uuid      = &char_uuid;
    attr_char_value.p_attr_md   = &attr_md;
    
    // BLUEBIRD: set characteristic length in number of bytes
    attr_char_value.max_len     = 2;
    attr_char_value.init_len    = 2;
    uint8_t value[2]            = {0x00, 0x00};
    attr_char_value.p_value     = value;

    // BLUEBIRD: add GPIO2 characteristic to the service
    err_code = sd_ble_gatts_characteristic_add(p_bluebird_gpio_service->service_handle,
                                       &char_md,
                                       &attr_char_value,
                                       &p_bluebird_gpio_service->gpio_three_char_handles);
    APP_ERROR_CHECK(err_code);
    
    printf("\r\nService handle: %#x\n\r", p_bluebird_gpio_service->service_handle);
    printf("Char value handle: %#x\r\n", p_bluebird_gpio_service->gpio_three_char_handles.value_handle);//char_handles.value_handle);
    printf("Char cccd handle: %#x\r\n\r\n", p_bluebird_gpio_service->gpio_three_char_handles.cccd_handle);//char_handles.cccd_handle);

    return NRF_SUCCESS;
}


/**@brief Function for adding GPIO4 characteristic to bluebird GPIO service 
 *
 * @param[in]   p_bluebird_gpio_service        Bluebird GPIO service structure 
 *
 */
static uint32_t gpio_four_char_add(bluebird_gpio_service_t *p_bluebird_gpio_service)
{
    uint32_t   err_code = 0; // Variable to hold return codes from library and softdevice functions
    
    // BLUEBIRD: add GPIO3 characteristic UUID
    ble_uuid_t          char_uuid;
    ble_uuid128_t       base_uuid = BLUEBIRD_UUID_BASE;
    char_uuid.uuid                = BLUEBIRD_UUID_CHARACTERISTIC_GPIO4;
    sd_ble_uuid_vs_add(&base_uuid, &char_uuid.type);
    APP_ERROR_CHECK(err_code);
    

    // BLUEBIRD: add read/write properties to our characteristic
    ble_gatts_char_md_t char_md;
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.read = 1;
    char_md.char_props.write = 1;

    
    // BLUEBIRD: configuring Client Characteristic Configuration Descriptor metadata and add to char_md structure
    ble_gatts_attr_md_t cccd_md;
    memset(&cccd_md, 0, sizeof(cccd_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.vloc                = BLE_GATTS_VLOC_STACK;    
    char_md.p_cccd_md           = &cccd_md;
    char_md.char_props.notify   = 1;
   
    
    // BLUEBIRD: configure the attribute metadata
    ble_gatts_attr_md_t attr_md;
    memset(&attr_md, 0, sizeof(attr_md)); 
    attr_md.vloc        = BLE_GATTS_VLOC_STACK;   
    
    
    // SENXIS: set read/write security levels to our characteristic
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    
    
    // BLUEBIRD: configure the characteristic value attribute
    ble_gatts_attr_t    attr_char_value;
    memset(&attr_char_value, 0, sizeof(attr_char_value));        
    attr_char_value.p_uuid      = &char_uuid;
    attr_char_value.p_attr_md   = &attr_md;
    
    // BLUEBIRD: set characteristic length in number of bytes
    attr_char_value.max_len     = 2;
    attr_char_value.init_len    = 2;
    uint8_t value[2]            = {0x00, 0x00};
    attr_char_value.p_value     = value;

    // BLUEBIRD: add GPIO2 characteristic to the service
    err_code = sd_ble_gatts_characteristic_add(p_bluebird_gpio_service->service_handle,
                                       &char_md,
                                       &attr_char_value,
                                       &p_bluebird_gpio_service->gpio_four_char_handles);
    APP_ERROR_CHECK(err_code);
    
    printf("\r\nService handle: %#x\n\r", p_bluebird_gpio_service->service_handle);
    printf("Char value handle: %#x\r\n", p_bluebird_gpio_service->gpio_four_char_handles.value_handle);//char_handles.value_handle);
    printf("Char cccd handle: %#x\r\n\r\n", p_bluebird_gpio_service->gpio_four_char_handles.cccd_handle);//char_handles.cccd_handle);

    return NRF_SUCCESS;
}

/**@brief Function for adding touch sensor characteristic to bluebird environmental service 
 *
 * @param[in]   p_bluebird_gpio_service        Bluebird GPIO service structure 
 *
 */
static uint32_t touch_sensor_char_add(bluebird_gpio_service_t *p_bluebird_gpio_service)
{
    uint32_t   err_code = 0; // Variable to hold return codes from library and softdevice functions
    
    // BLUEBIRD: add touch sensor characteristic UUID
    ble_uuid_t          char_uuid;
    ble_uuid128_t       base_uuid = BLUEBIRD_UUID_BASE;
    char_uuid.uuid                = BLUEBIRD_UUID_CHARACTERISTIC_CAP_TOUCH_BUTTON;
    sd_ble_uuid_vs_add(&base_uuid, &char_uuid.type);
    APP_ERROR_CHECK(err_code);
    

    // BLUEBIRD: add read/write properties to our characteristic
    ble_gatts_char_md_t char_md;
    memset(&char_md, 0, sizeof(char_md));
    char_md.char_props.read = 1;
    char_md.char_props.write = 1;

    
