JoeBakalor/NRF52DynamicGpioController/nrf_gpio_service.c
    // BLUEBIRD: configuring Client Characteristic Configuration Descriptor metadata and add to char_md structure
    ble_gatts_attr_md_t cccd_md;
    memset(&cccd_md, 0, sizeof(cccd_md));
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
    cccd_md.vloc                = BLE_GATTS_VLOC_STACK;    
    char_md.p_cccd_md           = &cccd_md;
    char_md.char_props.notify   = 1;
   
    
    // BLUEBIRD: configure the attribute metadata
    ble_gatts_attr_md_t attr_md;
    memset(&attr_md, 0, sizeof(attr_md)); 
    attr_md.vloc        = BLE_GATTS_VLOC_STACK;   
    
    
    // SENXIS: set read/write security levels to our characteristic
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
    
    
    // BLUEBIRD: configure the characteristic value attribute
    ble_gatts_attr_t    attr_char_value;
    memset(&attr_char_value, 0, sizeof(attr_char_value));        
    attr_char_value.p_uuid      = &char_uuid;
    attr_char_value.p_attr_md   = &attr_md;
    
    // BLUEBIRD: set characteristic length in number of bytes
    attr_char_value.max_len     = 1;
    attr_char_value.init_len    = 1;
    uint8_t value[4]            = {0x00};
    attr_char_value.p_value     = value;

    // BLUEBIRD: add touch sensor characteristic to the service
    err_code = sd_ble_gatts_characteristic_add(p_bluebird_gpio_service->service_handle,
                                       &char_md,
                                       &attr_char_value,
                                       &p_bluebird_gpio_service->touch_sensor_handles);
    APP_ERROR_CHECK(err_code);
    
    printf("\r\nService handle: %#x\n\r", p_bluebird_gpio_service->service_handle);
    printf("Char value handle: %#x\r\n", p_bluebird_gpio_service->touch_sensor_handles.value_handle);//char_handles.value_handle);
    printf("Char cccd handle: %#x\r\n\r\n", p_bluebird_gpio_service->touch_sensor_handles.cccd_handle);//char_handles.cccd_handle);

    return NRF_SUCCESS;
}


/*  Handle GPIO Service events */ 
void bluebird_gpio_service_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    //printf("\r\nBB SERVICE EVENT\n\r");
    
    if ((p_context == NULL) || (p_ble_evt == NULL))
    {
        NRF_LOG_INFO("Invalid GPIO Service Event");
        return;
    }

    /**/
    const uint8_t *received_data;
    uint8_t received_data_length;

    /**/
    bluebird_gpio_service_t * p_bluebird_gpio_service = (bluebird_gpio_service_t *)p_context;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            //on_connect(p_nus, p_ble_evt);
            break;

        case BLE_GATTS_EVT_WRITE:

            NRF_LOG_INFO("GPIO Service write event !!!!!");
            ble_gatts_evt_write_t const * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;

            /*=========================== GPIO1 ==============================*/
            if ( (p_evt_write->handle == p_bluebird_gpio_service->gpio_one_char_handles.value_handle) /*&& (p_evt_write->len == 2)*/ )
            {
               received_data = p_evt_write->data;
               received_data_length =  p_evt_write->len;
               
               for (int i = 0; i < received_data_length; i++)
               {
                  NRF_LOG_INFO("%02x", received_data[i]);
               }

               if (received_data[0] == 0)
               {
                  NRF_LOG_INFO("Set GPIO1 as an input");
                  #ifdef NEW
                  set_gpio_as_input(1);
                  #endif
                  /* SET GPIO1 AS INPUT.  THE CALL REQUIRES PULL DIRECTION.  DOES THE TEKNEST USER CONFIGURE THIS? */
               }
               else if (received_data[0]  == 1)
               {
                  #ifdef OLD
                  nrf_gpio_cfg_output(BLUEBIRD_GPIO1);
                  nrf_gpio_pin_write(BLUEBIRD_GPIO1, received_data[1]);
                  #elif defined NEW
                  /*new*/
                  set_gpio_as_output(1);
                  nrf_gpio_pin_write(BLUEBIRD_GPIO1, received_data[1]);
                  #endif

                  NRF_LOG_INFO("Set GPIO1 as an output and set value to %02x", received_data[1]);
               }
               
                NRF_LOG_INFO("GPIO1 Char written to !!!!!");
            } 
            /*=========================== GPIO2 ==============================*/
            else if ( (p_evt_write->handle == p_bluebird_gpio_service->gpio_two_char_handles.value_handle) /*&& (p_evt_write->len == 2)*/ )
            {
               received_data = p_evt_write->data;
               received_data_length =  p_evt_write->len;
               
               /**/
               for (int i = 0; i < received_data_length; i++)
               {
                  NRF_LOG_INFO("%02x", received_data[i]);
               }


               if (received_data[0] == 0)
               {
                  NRF_LOG_INFO("Set GPIO2 as an input");
                  #ifdef NEW
                  set_gpio_as_input(2);
                  #endif
               }
               else if (received_data[0]  == 1)
               {
                  #ifdef OLD
                  nrf_gpio_cfg_output(BLUEBIRD_GPIO2);
                  nrf_gpio_pin_write(BLUEBIRD_GPIO2, received_data[1]);
                  #elif defined NEW
                  /*new*/
                  set_gpio_as_output(2);
                  nrf_gpio_pin_write(BLUEBIRD_GPIO2, received_data[1]);
                  #endif
                  NRF_LOG_INFO("Set GPIO2 as an output and set value to %02x", received_data[1]);
               }

              NRF_LOG_INFO("GPIO2 Char written to !!!!!");
            }
            /*=========================== GPIO3 ==============================*/
            else if ( (p_evt_write->handle == p_bluebird_gpio_service->gpio_three_char_handles.value_handle) )
            {
               received_data = p_evt_write->data;
               received_data_length =  p_evt_write->len;
               
               /**/
               for (int i = 0; i < received_data_length; i++)
               {
                  NRF_LOG_INFO("%02x", received_data[i]);
               }

               if (received_data[0] == 0)
               {
                  NRF_LOG_INFO("Set GPIO3 as an input");
                  #ifdef NEW
                  set_gpio_as_input(3);
                  #endif
               }
               else if (received_data[0]  == 1)
               {
                  #ifdef OLD
                  nrf_gpio_cfg_output(BLUEBIRD_GPIO3);
                  nrf_gpio_pin_write(BLUEBIRD_GPIO3, received_data[1]);
                  #elif defined NEW
                  /*new*/
                  set_gpio_as_output(3);
                  nrf_gpio_pin_write(BLUEBIRD_GPIO3, received_data[1]);
                  #endif
                  NRF_LOG_INFO("Set GPIO3 as an output and set value to %02x", received_data[1]);
               }

              NRF_LOG_INFO("GPIO3 Char written to !!!!!");
            }
            /*=========================== GPIO4 ==============================*/
            else if ( (p_evt_write->handle == p_bluebird_gpio_service->gpio_four_char_handles.value_handle) )
            {
               received_data = p_evt_write->data;
               received_data_length =  p_evt_write->len;
               
               /**/
               for (int i = 0; i < received_data_length; i++)
               {
                  NRF_LOG_INFO("%02x", received_data[i]);
               }

               if (received_data[0] == 0)
               {
                  NRF_LOG_INFO("Set GPIO4 as an input");
                  #ifdef NEW
                  set_gpio_as_input(4);
                  #endif
               }
               else if (received_data[0]  == 1)
               {
                  /*old*/
                  #ifdef OLD
                  nrf_gpio_cfg_output(BLUEBIRD_GPIO4);
                  nrf_gpio_pin_write(BLUEBIRD_GPIO4, received_data[1]);
                  #elif defined NEW
                  /*new*/
                  set_gpio_as_output(4);
                  nrf_gpio_pin_write(BLUEBIRD_GPIO4, received_data[1]);
                  #endif
                  NRF_LOG_INFO("Set GPIO4 as an output and set value to %02x", received_data[1]);
               }
              NRF_LOG_INFO("GPIO4 Char written to !!!!!");
            }

            break;

