JoeBakalor/NRF52DynamicGpioController/nrf_gpio_service.c
        case BLE_GATTS_EVT_HVN_TX_COMPLETE:
            //on_hvx_tx_complete(p_nus, p_ble_evt);
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing bluebird GPIO service.
 *
 * @param[in]   p_bluebird_environmental_service        Bluebird environmental service structure
 *
 */
void bluebird_gpio_service_init(bluebird_gpio_service_t *p_bluebird_gpio_service)
{
    // BLUEBIRD: Declare 16 bit service and 128 bit base UUIDs and add them to BLE stack table     
    uint32_t   err_code;
    ble_uuid_t        service_uuid;
    ble_uuid128_t     base_uuid = BLUEBIRD_UUID_BASE;
    service_uuid.uuid = BLUEBIRD_UUID_SERVICE_GPIO;
    err_code = sd_ble_uuid_vs_add(&base_uuid, &service_uuid.type);
    APP_ERROR_CHECK(err_code);

    // BLUEBIRD: add bluebird environmental service
    err_code = sd_ble_gatts_service_add(BLE_GATTS_SRVC_TYPE_PRIMARY,
                                        &service_uuid,
                                        &p_bluebird_gpio_service->service_handle);
    APP_ERROR_CHECK(err_code);

    // BLUEBIRD: add characteristics to bluebird GPIO service 
    gpio_one_char_add(p_bluebird_gpio_service);
    gpio_two_char_add(p_bluebird_gpio_service);
    gpio_three_char_add(p_bluebird_gpio_service);
    gpio_four_char_add(p_bluebird_gpio_service);
    touch_sensor_char_add(p_bluebird_gpio_service);
}

/**@brief 
 *
 * @param[in]   p_bluebird_gpio_service                Pointer to bluebird GPIO Service structure.
 * @param[in]   gpio_value          				   New gpio value
 * @param[in]   gpio_configuration_t                   configured as input or output 
 */
uint32_t bluebird_gpio_one_char_update(bluebird_gpio_service_t *p_bluebird_gpio_service, uint8_t *gpio_value, uint8_t gpio_value_length)
{
    if (p_bluebird_gpio_service == NULL)
    {
        return NRF_ERROR_NULL;
    }

    //uint8_t gpio_one_update[2] = { gpio_value, gpio_configuration}; 

    uint32_t err_code = NRF_SUCCESS;
    ble_gatts_value_t gatts_value;

    // Initialize value struct.
    memset(&gatts_value, 0, sizeof(gatts_value));

    gatts_value.len     = gpio_value_length;//2;//sizeof(uint8_t);
    gatts_value.offset  = 0;
    gatts_value.p_value = gpio_value;//(uint8_t *)gpio_one_update;

    // Update database.
    err_code = sd_ble_gatts_value_set(p_bluebird_gpio_service->conn_handle,
                                      p_bluebird_gpio_service->gpio_one_char_handles.value_handle,//->battery_level_char_handles.value_handle,//battery_level_handles.value_handle,
                                      &gatts_value);
    if (err_code == NRF_SUCCESS)
    {

    }
    else
    {
        return err_code;
    }

    // Send value if connected and notifying.
    if ((p_bluebird_gpio_service->conn_handle != BLE_CONN_HANDLE_INVALID))// && p_bas->is_notification_supported)
    {
        ble_gatts_hvx_params_t hvx_params;

        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_bluebird_gpio_service->gpio_one_char_handles.value_handle;//->battery_level_handles.value_handle;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset = gatts_value.offset;
        hvx_params.p_len  = &gatts_value.len;
        hvx_params.p_data = gatts_value.p_value;

        err_code = sd_ble_gatts_hvx(p_bluebird_gpio_service->conn_handle, &hvx_params);
    }
    else
    {
        err_code = NRF_ERROR_INVALID_STATE;
    }

    return err_code;
}



/**@brief 
 *
 * @param[in]   p_bluebird_environmental_service       Pointer to bluebird environmental Service structure.
 * @param[in]   temperature          				   New temperature value
 */
uint32_t bluebird_gpio_two_char_update(bluebird_gpio_service_t *p_bluebird_gpio_service, uint8_t *gpio_value, uint8_t gpio_value_length)
{
    if (p_bluebird_gpio_service == NULL)
    {
        return NRF_ERROR_NULL;
    }

    //uint8_t gpio_two_update[2] = { gpio_value, gpio_configuration}; 

    uint32_t err_code = NRF_SUCCESS;
    ble_gatts_value_t gatts_value;

    // Initialize value struct.
    memset(&gatts_value, 0, sizeof(gatts_value));

    gatts_value.len     = gpio_value_length;//2;//sizeof(uint8_t);
    gatts_value.offset  = 0;
    gatts_value.p_value = gpio_value;//(uint8_t *)gpio_two_update;

    // Update database.
    err_code = sd_ble_gatts_value_set(p_bluebird_gpio_service->conn_handle,
                                      p_bluebird_gpio_service->gpio_two_char_handles.value_handle,//->battery_level_char_handles.value_handle,//battery_level_handles.value_handle,
                                      &gatts_value);
    if (err_code == NRF_SUCCESS)
    {

    }
    else
    {
        return err_code;
    }

    // Send value if connected and notifying.
    if ((p_bluebird_gpio_service->conn_handle != BLE_CONN_HANDLE_INVALID))// && p_bas->is_notification_supported)
    {
        ble_gatts_hvx_params_t hvx_params;

        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_bluebird_gpio_service->gpio_two_char_handles.value_handle;//->battery_level_handles.value_handle;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset = gatts_value.offset;
        hvx_params.p_len  = &gatts_value.len;
        hvx_params.p_data = gatts_value.p_value;

        err_code = sd_ble_gatts_hvx(p_bluebird_gpio_service->conn_handle, &hvx_params);
    }
    else
    {
        err_code = NRF_ERROR_INVALID_STATE;
    }
    //}

    return err_code;
}

/**@brief 
 *
 * @param[in]   p_bluebird_environmental_service       Pointer to bluebird environmental Service structure.
 * @param[in]   temperature          				   New temperature value
 */
uint32_t bluebird_gpio_three_char_update(bluebird_gpio_service_t *p_bluebird_gpio_service, uint8_t *gpio_value, uint8_t gpio_value_length)
{
    if (p_bluebird_gpio_service == NULL)
    {
        return NRF_ERROR_NULL;
    }

    //uint8_t gpio_three_update[2] = { gpio_value, gpio_configuration}; 

