JoeBakalor/NRF52DynamicGpioController/nrf_gpio_service.c
    uint32_t err_code = NRF_SUCCESS;
    ble_gatts_value_t gatts_value;

    // Initialize value struct.
    memset(&gatts_value, 0, sizeof(gatts_value));

    gatts_value.len     = gpio_value_length;//2;//sizeof(uint8_t);
    gatts_value.offset  = 0;
    gatts_value.p_value = gpio_value;//(uint8_t *)gpio_three_update;

    // Update database.
    err_code = sd_ble_gatts_value_set(p_bluebird_gpio_service->conn_handle,
                                      p_bluebird_gpio_service->gpio_three_char_handles.value_handle,//->battery_level_char_handles.value_handle,//battery_level_handles.value_handle,
                                      &gatts_value);
    if (err_code == NRF_SUCCESS)
    {

    }
    else
    {
        return err_code;
    }

    // Send value if connected and notifying.
    if ((p_bluebird_gpio_service->conn_handle != BLE_CONN_HANDLE_INVALID))// && p_bas->is_notification_supported)
    {
        ble_gatts_hvx_params_t hvx_params;

        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_bluebird_gpio_service->gpio_three_char_handles.value_handle;//->battery_level_handles.value_handle;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset = gatts_value.offset;
        hvx_params.p_len  = &gatts_value.len;
        hvx_params.p_data = gatts_value.p_value;

        err_code = sd_ble_gatts_hvx(p_bluebird_gpio_service->conn_handle, &hvx_params);
    }
    else
    {
        err_code = NRF_ERROR_INVALID_STATE;
    }
    //}

    return err_code;
}


/**@brief 
 *
 * @param[in]   p_bluebird_environmental_service       Pointer to bluebird environmental Service structure.
 * @param[in]   temperature          				   New temperature value
 */
uint32_t bluebird_gpio_four_char_update(bluebird_gpio_service_t *p_bluebird_gpio_service, uint8_t *gpio_value, uint8_t gpio_value_length)//gpio_configuration_t gpio_configuration)
{
    if (p_bluebird_gpio_service == NULL)
    {
        return NRF_ERROR_NULL;
    }

    //uint8_t gpio_four_update[2] = { gpio_value, gpio_configuration}; 

    uint32_t err_code = NRF_SUCCESS;
    ble_gatts_value_t gatts_value;

    // Initialize value struct.
    memset(&gatts_value, 0, sizeof(gatts_value));

    gatts_value.len     = gpio_value_length;//2;//sizeof(uint8_t);
    gatts_value.offset  = 0;
    gatts_value.p_value = gpio_value;//(uint8_t *)gpio_four_update;

    // Update database.
    err_code = sd_ble_gatts_value_set(p_bluebird_gpio_service->conn_handle,
                                      p_bluebird_gpio_service->gpio_four_char_handles.value_handle,//->battery_level_char_handles.value_handle,//battery_level_handles.value_handle,
                                      &gatts_value);
    if (err_code == NRF_SUCCESS)
    {

    }
    else
    {
        return err_code;
    }

    // Send value if connected and notifying.
    if ((p_bluebird_gpio_service->conn_handle != BLE_CONN_HANDLE_INVALID))// && p_bas->is_notification_supported)
    {
        ble_gatts_hvx_params_t hvx_params;

        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_bluebird_gpio_service->gpio_four_char_handles.value_handle;//->battery_level_handles.value_handle;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset = gatts_value.offset;
        hvx_params.p_len  = &gatts_value.len;
        hvx_params.p_data = gatts_value.p_value;

        err_code = sd_ble_gatts_hvx(p_bluebird_gpio_service->conn_handle, &hvx_params);
    }
    else
    {
        err_code = NRF_ERROR_INVALID_STATE;
    }
    //}

    return err_code;
}

/**@brief Function for updating temperature characteristic value
 *
 * @param[in]   p_bluebird_environmental_service       Pointer to bluebird environmental Service structure.
 * @param[in]   humidity            				   New humidity value
 */
uint32_t bluebird_touch_sensor_char_update(bluebird_gpio_service_t *p_bluebird_gpio_service, uint8_t touch_sensor_state)
{
    if (p_bluebird_gpio_service == NULL)
    {
        return NRF_ERROR_NULL;
    }

    uint32_t err_code = NRF_SUCCESS;
    ble_gatts_value_t gatts_value;

    // Initialize value struct.
    memset(&gatts_value, 0, sizeof(gatts_value));

    gatts_value.len     = sizeof(uint8_t);
    gatts_value.offset  = 0;
    gatts_value.p_value = &touch_sensor_state;

    // Update database.
    err_code = sd_ble_gatts_value_set(p_bluebird_gpio_service->conn_handle,
                                      p_bluebird_gpio_service->touch_sensor_handles.value_handle,//->battery_level_char_handles.value_handle,//battery_level_handles.value_handle,
                                      &gatts_value);
    if (err_code == NRF_SUCCESS)
    {
        // Save new battery value.
        //p_bas->battery_level_last = battery_level;
    }
    else
    {
        return err_code;
    }

    // Send value if connected and notifying.
    if ((p_bluebird_gpio_service->conn_handle != BLE_CONN_HANDLE_INVALID))// && p_bas->is_notification_supported)
    {
        ble_gatts_hvx_params_t hvx_params;

        memset(&hvx_params, 0, sizeof(hvx_params));

        hvx_params.handle = p_bluebird_gpio_service->touch_sensor_handles.value_handle;//->battery_level_handles.value_handle;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;
        hvx_params.offset = gatts_value.offset;
        hvx_params.p_len  = &gatts_value.len;
        hvx_params.p_data = gatts_value.p_value;

        err_code = sd_ble_gatts_hvx(p_bluebird_gpio_service->conn_handle, &hvx_params);
    }
    else
    {
        err_code = NRF_ERROR_INVALID_STATE;
    }
    //}

    return err_code;
}